{"id":"roasted-chicken-and-potatoes","category":"main-courses","image":"images/main-courses/roasted-chicken-and-potatoes.jpg","title":{"ro":"Pui și Cartofi la Cuptor","en":"Roasted Chicken and Potatoes"},"prepTime":50,"servings":4,"effortLevel":"medium","ingredients":[{"name":{"ro":"cartofi","en":"potatoes"},"quantity":1200,"unit":{"ro":"g","en":"g"},"ingredientId":142},{"name":{"ro":"ulei de măsline virgin","en":"virgin olive oil"},"quantity":5,"unit":{"ro":"linguri","en":"Tbsp"},"ingredientId":101},{"name":{"ro":"suc de lămâie","en":"lemon juice"},"quantity":3,"unit":{"ro":"linguri","en":"Tbsp"},"ingredientId":105},{"name":{"ro":"pulpe sau piepturi de pui tăiate în bucăți","en":"chicken thighs or breasts in chunks"},"quantity":800,"unit":{"ro":"g","en":"g"},"ingredientId":147},{"name":{"ro":"căței de usturoi ușor zdrobiți","en":"garlic cloves lightly smashed"},"quantity":6,"unit":{"ro":"buc","en":"pcs"},"ingredientId":104},{"name":{"ro":"pătrunjel proaspăt tocat","en":"fresh parsley minced"},"quantity":1,"unit":{"ro":"cană","en":"cup"},"ingredientId":116},{"name":{"ro":"oregano uscat","en":"dried oregano"},"quantity":2,"unit":{"ro":"linguri","en":"Tbsp"},"ingredientId":103},{"name":{"ro":"usturoi granulat","en":"granulated garlic"},"quantity":1,"unit":{"ro":"lingură","en":"Tbsp"},"ingredientId":148},{"name":{"ro":"sare","en":"salt"},"quantity":1,"unit":{"ro":"după gust","en":"to taste"}},{"name":{"ro":"piper","en":"pepper"},"quantity":1,"unit":{"ro":"după gust","en":"to taste"}}],"instructions":{"ro":["Taie cartofii: cei mici în jumătate, cei medii în 4-6 bucăți. Adaugă cartofii într-o cratiță cu apă sărată și fierbe pentru 6 minute pentru a-i parboli. Preîncălzește cuptorul cu convecție la 240 Celsius.","Pentru marinadă: Într-un bol, amestecă pătrunjel, 3 linguri de suc de lămâie, usturoiul zdrobit, 3 linguri ulei de măsline, 1 linguriță de sare și puțin piper zdrobit. Transferă jumătate din marinadă într-un bol mare.","Adaugă usturoiul granulat, oregano uscat, puțină sare și 2 linguri de ulei de măsline. Adaugă puiul. Scurge cartofii parboliți și adaugă-i de asemenea. Amestecă totul pentru a combina.","Când totul este bine acoperit, întinde într-o tavă pe o foaie de gătit. Pune în cuptor pentru a se rumeni, timp de 25 minute.","Ultimele 5 minute folosește grătarul (broiler) pentru o crustă frumoasă și crocantă.","Mută cartofii și puiul într-un bol, adaugă marinada rămasă și amestecă pentru a acoperi totul.","Servește cu ierburi proaspete/salată."],"en":["Cut the potatoes: small ones in half, medium ones into 4-6 pieces. Add potatoes to a pan with salted water and boil for 6 minutes to parboil them. Preheat the convection oven to 240 Celsius.","For the marinade: In a bowl, toss together the parsley, 3 Tbsp lemon juice, the crushed garlic, 3 Tbsp olive oil, 1 tsp of salt and some crushed pepper. Transfer half of the marinade to a large bowl.","Add the granulated garlic, the dried oregano, a bit more salt and 2 Tbsp of olive oil. Add the chicken. Drain the parboiled potatoes and add them as well. Toss everything to mix.","When everything is nicely coated, spread in a tray on a cooking sheet. Toss in the oven to roast for 25 minutes.","For the last 5 minutes use the broiler for a nice crispy crust.","Move the potatoes and the chicken to a bowl, add the remaining marinade and toss to coat everything.","Serve with fresh herbs/salad."]},"personalNotes":{"ro":"Rețetă de la: One-Pan Roasted Chicken and Potatoes | Kenji's Cooking Show","en":"Recipe from: One-Pan Roasted Chicken and Potatoes | Kenji's Cooking Show"},"keywords":["medium","chicken","oven-baked","potatoes","olive-oil"],"dateAdded":"2025-11-17"}